## Python Pandas Assignment 1

In [1]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

Q1. List any five functions of the pandas library with execution.

A. Five functions:
    head
    describe
    shape
    value_counts
    nunique
    
B. Exmaple of each function is given below:

In [2]:
## head() : It gives the first five records from the dataframe.
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
## describe() : It gives basic statistical report of numerical features. By default it gives report for numerical features but we can also generate statistical reportfor categorical features.
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
## Shape : It gives the total no. of row and columns from the dataframe.
df.shape

(891, 12)

In [6]:
## Value_counts: It gives total no. of unique value counts for dataframe features
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [9]:
## nunique(): It gives you how many unique values are there for dataframe feature.
df['Pclass'].nunique()

3

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C',
write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
df1 = pd.DataFrame({
    "A" : [1,2,3],
    "B" : [4,5,6],
    "C" : [7,8,9]
})

df1.reindex([1, 3, 5])

df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [33]:

df2 = pd.DataFrame({
    "Values" : [10,20,30,40,50,60]
})
sum = 0
for index, rows in df2.iloc[0:3].iterrows():
    sum = sum + rows['Values']

print(sum)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
df3 = pd.DataFrame({
    "desc": ["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.", "my name is aakash bhatt.", "I used to take data science class."]
})

def count_no_of_words(x):
    return len(x.split(" "))

df3['Word_Count'] = df3['desc'].apply(count_no_of_words)

df3

                                                desc  Word_Count
0  Data Science Masters course is highly curated ...         104
1                           my name is aakash bhatt.           5
2                 I used to take data science class.           7

Q5. How are DataFrame.size() and DataFrame.shape() different?

A. Dataframe Shape: It gives us the total number of rows and columsn present in the dataframe.

B. Dataframe Size : Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.

Exmaple of each has been given below:

In [25]:
## Example of Shape:
df.shape

(891, 12)

In [26]:
## Example of Size:
df.size

10692

Q6. Which function of pandas do we use to read an excel file?

Ans: pd.read_excel() function has been used to read an excel file in pandas.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [32]:
df4 = pd.DataFrame({
    "email" : ["aakash@gmail.com", "vikas@gmail.com", "datascience@gmail.com", "rk@gmail.com", "john.doe@gmail.com"]
})

def get_username(x):
    return x.split("@")[0]

df4['Username'] = df4['email'].apply(get_username)

df4

                   email     Username
0       aakash@gmail.com       aakash
1        vikas@gmail.com        vikas
2  datascience@gmail.com  datascience
3           rk@gmail.com           rk
4     john.doe@gmail.com     john.doe

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. 

Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. 

The function should return a new DataFrame that contains only the selected rows.

In [36]:
df5 = pd.DataFrame({
    "A":[3,8,6,2,9],
    "B":[5,2,9,3,1],
    "C":[1,7,4,5,2]
})

df5_output = df5[(df5["A"] > 5) & (df5["B"] < 10)]

df5_output

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [38]:
## Mean:
df2['Values'].mean()

35.0

In [39]:
## Median:
df2['Values'].median()

35.0

In [40]:
## Standard deviation:
df2['Values'].std()

18.708286933869708

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', 

write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. 

The moving average should be calculated using a window of size 7 and should include the current day.

In [42]:
df6 = pd.DataFrame({
    "Date" : ["2022-12-01", "2022-12-02", "2022-12-03", "2022-12-04", "2022-12-05", "2022-12-06", "2022-12-07", "2022-12-08", "2022-12-09", "2022-12-10"],
    "Sales" : [25,35,45,55,65,55,45,35,25,15]
})

df6['MovingAverage'] = df6['Sales'].rolling(window=7).mean()

df6

         Date  Sales  MovingAverage
0  2022-12-01     25            NaN
1  2022-12-02     35            NaN
2  2022-12-03     45            NaN
3  2022-12-04     55            NaN
4  2022-12-05     65            NaN
5  2022-12-06     55            NaN
6  2022-12-07     45      46.428571
7  2022-12-08     35      47.857143
8  2022-12-09     25      46.428571
9  2022-12-10     15      42.142857

Q11. You have a Pandas DataFrame df with a column 'Date'. 

Write a Python function that creates a new column 'Weekday' in the DataFrame. 

The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.

In [47]:
from datetime import datetime

df7 = pd.DataFrame({
    "Date_str" : ["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04", "2023-01-05"]
})

df7['Date'] = pd.to_datetime(df7['Date_str'])

df7.drop(['Date_str'], axis = 1, inplace = True)

df7['Weekday'] = df7['Date'].dt.strftime('%A')

df7

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, 

write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [50]:
### It will generate dates between start and end dates entered by the user:
data = pd.date_range(start = "2022-12-01", end = "2023-03-31")

df8 = pd.DataFrame({"date": data})

df8[(df8['date'] > '2023-01-01') & (df8['date'] < '2023-01-31')]

         date
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

Ans : Pandas is first and foremost necessary liabrary that needs to be imported to use the basic functions of pandas.